class ItemMod {
  final int id;
  final String name;
  final String tit;
  final String longtit;
  final String group;
  final String image;
  final String star;
  final String type;

  const ItemMod(
      {required this.id,
      required this.name,
      required this.tit,
      required this.group,
      required this.image,
      required this.star,
      required this.longtit,
      this.type = 'گیاه'});

  static List<ItemMod> itemlist() {
    return [
      ItemMod(
        longtit:
            'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد',
        id: 1,
        name: "بونسای",
        tit: "لورم ایپسوم متن ساختگی با تولید ...",
        group: "گیاهان آپارتمانی",
        image: 'assets/images/img1.png',
        star: '۵.۵',
      ),
      ItemMod(
        longtit:
            'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد',
        id: 2,
        name: "کاج",
        tit: "لورم ایپسوم متن ساختگی با تولید ...",
        group: "گیاهان آپارتمانی",
        image: 'assets/images/house-plant-png-30.png',
        star: '۵.۱',
      ),
      ItemMod(
        longtit:
            'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد',
        id: 3,
        name: "شمشاد",
        tit: "لورم ایپسوم متن ساختگی با تولید ...",
        group: "گیاهان آپارتمانی",
        image: 'assets/images/12-2-plants-png-file.png',
        star: '۲.۵',
      ),
      ItemMod(
        longtit:
            'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد کتابهای زیادی در شصت و سه درصد گذشته حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد',
        id: 4,
        name: "اکالیپتوس",
        tit: "لورم ایپسوم متن ساختگی با تولید ...",
        group: "گیاهان آپارتمانی",
        image: 'assets/images/Indoor-Hanging-Plant-PNG-High-Quality-Image.png',
        star: '۱.۱',
      ),
    ];
  }
}
